#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.import-test.github_repository.repository: Refreshing state... [id=import-test]
module.perl-demo.github_repository.repository: Refreshing state... [id=perl-demo]
module.perl-show.github_repository.repository: Refreshing state... [id=perl-show]
module.github-demo.github_repository.repository: Refreshing state... [id=tf-github-demo]
module.show-import.github_repository.repository: Refreshing state... [id=show-import]
module.repository.github_repository.repository: Refreshing state... [id=demo-repo]
module.perl-demo.github_branch_default.default[0]: Refreshing state... [id=perl-demo]
module.perl-demo.github_issue_label.label["enhancement"]: Refreshing state... [id=perl-demo:enhancement]
module.perl-demo.github_team_repository.team_repository[0]: Refreshing state... [id=8452031:perl-demo]
module.perl-demo.github_issue_label.label["duplicate"]: Refreshing state... [id=perl-demo:duplicate]
module.perl-demo.github_issue_label.label["good first issue"]: Refreshing state... [id=perl-demo:good first issue]
module.perl-demo.github_issue_label.label["bug"]: Refreshing state... [id=perl-demo:bug]
module.perl-demo.github_issue_label.label["question"]: Refreshing state... [id=perl-demo:question]
module.perl-demo.github_issue_label.label["documentation"]: Refreshing state... [id=perl-demo:documentation]
module.perl-demo.github_issue_label.label["wontfix"]: Refreshing state... [id=perl-demo:wontfix]
module.perl-demo.github_issue_label.label["invalid"]: Refreshing state... [id=perl-demo:invalid]
module.perl-demo.github_issue_label.label["help wanted"]: Refreshing state... [id=perl-demo:help wanted]
module.perl-show.github_team_repository.team_repository[0]: Refreshing state... [id=8452031:perl-show]
module.perl-show.github_branch_default.default[0]: Refreshing state... [id=perl-show]
module.perl-show.github_issue_label.label["wontfix"]: Refreshing state... [id=perl-show:wontfix]
module.perl-show.github_issue_label.label["invalid"]: Refreshing state... [id=perl-show:invalid]
module.perl-show.github_issue_label.label["bug"]: Refreshing state... [id=perl-show:bug]
module.perl-show.github_issue_label.label["good first issue"]: Refreshing state... [id=perl-show:good first issue]
module.perl-show.github_issue_label.label["enhancement"]: Refreshing state... [id=perl-show:enhancement]
module.perl-show.github_issue_label.label["duplicate"]: Refreshing state... [id=perl-show:duplicate]
module.perl-show.github_issue_label.label["documentation"]: Refreshing state... [id=perl-show:documentation]
module.perl-show.github_issue_label.label["question"]: Refreshing state... [id=perl-show:question]
module.perl-show.github_issue_label.label["help wanted"]: Refreshing state... [id=perl-show:help wanted]
module.github-demo.github_issue_label.label["question"]: Refreshing state... [id=tf-github-demo:question]
module.github-demo.github_issue_label.label["bug"]: Refreshing state... [id=tf-github-demo:bug]
module.github-demo.github_issue_label.label["enhancement"]: Refreshing state... [id=tf-github-demo:enhancement]
module.github-demo.github_issue_label.label["documentation"]: Refreshing state... [id=tf-github-demo:documentation]
module.github-demo.github_issue_label.label["good first issue"]: Refreshing state... [id=tf-github-demo:good first issue]
module.github-demo.github_issue_label.label["wontfix"]: Refreshing state... [id=tf-github-demo:wontfix]
module.github-demo.github_issue_label.label["duplicate"]: Refreshing state... [id=tf-github-demo:duplicate]
module.github-demo.github_issue_label.label["help wanted"]: Refreshing state... [id=tf-github-demo:help wanted]
module.github-demo.github_issue_label.label["invalid"]: Refreshing state... [id=tf-github-demo:invalid]
module.github-demo.github_branch_default.default[0]: Refreshing state... [id=tf-github-demo]
module.github-demo.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=tf-github-demo:main]
module.show-import.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=show-import:main]
module.perl-demo.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=perl-demo:main]
module.perl-show.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=perl-show:main]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.github-demo.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"6f2fe7866421f1c598e38e6a8395a12ab84ba9a380b67c2c501812105965c20a\"" -> "W/\"6a9c3a8548c320bbce3e1e5aefeca3e4f36ef76596831087524da7024a98d508\""
        id                          = "tf-github-demo"
        name                        = "tf-github-demo"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.import-test.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"7a3588f60493de07c6976156b8928c1c6d6cdc1714a210e30c2004caa7cd4076\"" -> "W/\"59e5459a26714443b1c442af5f40076e1714af041c38fb72410db37f834ed988\""
        id                          = "import-test"
        name                        = "import-test"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.perl-demo.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"f65b87cfb6e372ca69de25bc73adcfe490b8d1c2eb3f2e7cb458700ccadf586d\"" -> "W/\"1adb91d2138bb37c603a289b64f087978b82afbe16fcab4aa634c7cae507015e\""
        id                          = "perl-demo"
        name                        = "perl-demo"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.perl-show.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"67bc59a09dd3a6c3daea81a6050a870c05751d7489563af346fd0ba83842dc2b\"" -> "W/\"33c04adfc72a7b630e49ccbe67d4b8b50ebde2156a875dd513df5fd0183a89b6\""
        id                          = "perl-show"
        name                        = "perl-show"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.show-import.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"aa98df91a0efe781e751bca1863fcd7bcb6f6ed2d4d61406de6ba52300ba83d1\"" -> "W/\"cbe2c34c290024d603f8ec51d42e4ca5ca70ee876b76449f1ec3e352562903e2\""
        id                          = "show-import"
        name                        = "show-import"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord-bot.github_branch_default.default[0] will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "discord-bot"
    }

  # module.discord-bot.github_branch_protection_v3.branch_protection[0] will be created
  + resource "github_branch_protection_v3" "branch_protection" {
      + branch                          = "main"
      + enforce_admins                  = true
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + repository                      = "discord-bot"
      + require_conversation_resolution = false
      + require_signed_commits          = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_users                 = [
              + "benpngo",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = true
        }

      + restrictions {}
    }

  # module.discord-bot.github_issue_label.label["bug"] will be created
  + resource "github_issue_label" "label" {
      + color       = "d73a4a"
      + description = "Something isn't working"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bug"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_issue_label.label["documentation"] will be created
  + resource "github_issue_label" "label" {
      + color       = "0075ca"
      + description = "Improvements or additions to documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_issue_label.label["duplicate"] will be created
  + resource "github_issue_label" "label" {
      + color       = "cfd3d7"
      + description = "This issue or pull request already exists"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "duplicate"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_issue_label.label["enhancement"] will be created
  + resource "github_issue_label" "label" {
      + color       = "a2eeef"
      + description = "New feature or request"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "enhancement"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_issue_label.label["good first issue"] will be created
  + resource "github_issue_label" "label" {
      + color       = "7057ff"
      + description = "Good for newcomers"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "good first issue"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_issue_label.label["help wanted"] will be created
  + resource "github_issue_label" "label" {
      + color       = "008672"
      + description = "Extra attention is needed"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "help wanted"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_issue_label.label["invalid"] will be created
  + resource "github_issue_label" "label" {
      + color       = "e4e669"
      + description = "This doesn't seem right"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "invalid"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_issue_label.label["question"] will be created
  + resource "github_issue_label" "label" {
      + color       = "d876e3"
      + description = "Further information is requested"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "question"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_issue_label.label["wontfix"] will be created
  + resource "github_issue_label" "label" {
      + color       = "ffffff"
      + description = "This will not be worked on"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "wontfix"
      + repository  = "discord-bot"
      + url         = (known after apply)
    }

  # module.discord-bot.github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = false
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Discord Bot"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + homepage_url                = "https://github.com/ben-demo-org/discord-bot"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "discord-bot"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "random",
          + "stuff",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
    }

  # module.github-demo.github_branch_protection_v3.branch_protection[0] will be updated in-place
  ~ resource "github_branch_protection_v3" "branch_protection" {
        id                              = "tf-github-demo:main"
        # (6 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_users                 = [
              + "benpngo",
            ]
            # (5 unchanged attributes hidden)

          - bypass_pull_request_allowances {
              - apps  = [] -> null
              - teams = [] -> null
              - users = [
                  - "benpngo",
                ] -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 12 to add, 1 to change, 0 to destroy.

Warning: "required_status_checks.0.contexts": [DEPRECATED] GitHub is deprecating the use of `contexts`. Use a `checks` array instead.

  with module.discord-bot.github_branch_protection_v3.branch_protection[0],
  on .terraform/modules/discord-bot/main.tf line 240, in resource "github_branch_protection_v3" "branch_protection":
 240: resource "github_branch_protection_v3" "branch_protection" {

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @benpngo, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Demo Plan`*